#Company ABC Profit

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_csv("CompanyABCProfit.csv")
df.head()

   Year  Profit(Rs '000)
0  1821             1645
1  1822              658
2  1823             1926
3  1824              865
4  1825              764

In [8]:
df.rename(columns={"Profit(Rs '000)": "Profit"}, inplace=True)

In [9]:
df.head()

   Year  Profit
0  1821    1645
1  1822     658
2  1823    1926
3  1824     865
4  1825     764

In [10]:
df.Profit.quantile(0.75)

np.float64(1318.25)

In [11]:
df.shape

(200, 2)

In [14]:
min,max = df.Profit.quantile([0.001,0.999])
min, max

(-379.369, 2053.01)

In [15]:
df2 = df[(df.Profit > min) & (df.Profit < max)]
df2

     Year  Profit
0    1821    1645
1    1822     658
2    1823    1926
3    1824     865
4    1825     764
..    ...     ...
195  2016     988
196  2017     895
197  2018    -178
198  2019     543
199  2020     316

[198 rows x 2 columns]

In [16]:
df2.shape

(198, 2)

In [18]:
mean = df.Profit.mean()
mean

np.float64(1021.99)

In [19]:
std = df.Profit.std()
std

np.float64(487.9556264321933)

In [25]:
df3 = df[(df.Profit > (mean - 2*std)) & (df.Profit < (mean + 2*std))]
df3.shape

(193, 2)

In [26]:
df['zscore'] = (df.Profit - df.Profit.mean())/df.Profit.std()
df.head()

   Year  Profit    zscore
0  1821    1645  1.276776
1  1822     658 -0.745949
2  1823    1926  1.852648
3  1824     865 -0.321730
4  1825     764 -0.528716

In [29]:
df4=df[(df.zscore > -2) & (df.zscore < 2)]
df4.shape

(193, 3)